console.log('Початок програми');

setTimeout(() => {
    console.log('setTimeout');
}, 0);

Promise.resolve().then(() => {
    console.log('Promise');
});

process.nextTick(() => {
    console.log('nextTick');
});

console.log('Кінець програми');

// Початок програми
// Це синхронний код, тому виконується одразу.
// Кінець програми
// Це синхронний код, тому виконується одразу.
// nextTick
// Ця функція додається до черги Next Tick Queue, яка виконується перед чергою мікрозадач.
// Promise
// Проміси додаються до черги Microtask Queue (мікрозадачі). Мікрозадачі завжди виконуються перед макрозадачами.
// setTimeout
// Ця функція передається в чергу Timers. Вона виконається після всіх мікрозадач.
